10/data/attachments/9acfc49ce37ec875.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Nicholas_now_Friend_1529_8</nif:username>
            <nif:friendToBeRequested>soap_friends_2c1b31c5-c3fd-411f-bd6d-e929b1593c3f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>